Revit 2024 API
GroundConductorSizeSet.Erase Method
Removes a specified GroundConductorSize from the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual int Erase(
	GroundConductorSize item
)
Visual Basic
Public Overridable Function Erase ( _
	item As GroundConductorSize _
) As Integer
Visual C++
public:
virtual int Erase(
	GroundConductorSize^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Electrical.GroundConductorSize
The GroundConductorSize to be erased.
Return Value
The number of GroundConductorSizes that were erased from the set.
See Also
GroundConductorSizeSet Class
Autodesk.Revit.DB.Electrical Namespace